<a href="https://colab.research.google.com/github/Kfdez95/Caso_3/blob/master/Caso3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#Conectamos al Drive
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
#Importamos librerías necesarias y el archivo con los datos
import numpy as np
import pandas as pd
df = pd.read_csv('/content/drive/MyDrive/Caso_3/data.csv', sep=';')

In [3]:
#Mostramos los primeros 5 valores del DataFrame
df.head()

   id    FirstName LastName  ... HourlyRate MaritalStatus OverTime
0   1    Kimberley    Kuhic  ...         40        Single      Yes
1   1        Kitty  Ruecker  ...         76       Married       No
2   5        Jamal     Cole  ...         89        Single      Yes
3   5  Christopher  D'Amore  ...         78       Married       No
4   5        Carly    Ratke  ...         86        Single      Yes

[5 rows x 12 columns]

In [4]:
#Mostramos los últimos 5 valores del DataFrame
df.tail()

      id FirstName  LastName  ... HourlyRate MaritalStatus OverTime
995  996    Linnie    Larson  ...         92        Single      Yes
996  997    Agusta  Emmerich  ...         91      Divorced       No
997  997    Andrew  Schulist  ...         34        Single       No
998  997     Brook    Turner  ...         49       Married       No
999  999     Maceo    Wisoky  ...         33       Married       No

[5 rows x 12 columns]

In [5]:
#Mostramos el tipo de datos de cada columna
df.dtypes

id                 int64
FirstName         object
LastName          object
Gender            object
Birthday          object
Status            object
Salary           float64
Taxes             object
Department        object
HourlyRate        object
MaritalStatus     object
OverTime          object
dtype: object

In [6]:
#Mostramos la cantidad de valores nulos de cada columna
df.isnull().sum()

id                 0
FirstName          2
LastName           2
Gender           207
Birthday           2
Status           178
Salary             2
Taxes            993
Department        12
HourlyRate         2
MaritalStatus     25
OverTime           2
dtype: int64

In [7]:
#Mostramos el porcentaje total de valores perdidos en todo el dataframe 
total_cells = np.product(df.shape)
total_missing = df.isnull().sum().sum()
total_missing/total_cells*100

11.891666666666667

In [8]:
#Mostramos el porcentaje de valores perdidos por columna
Porcentajes_null = df.isnull().sum()/len(df.index)*100
Porcentajes_null

id                0.0
FirstName         0.2
LastName          0.2
Gender           20.7
Birthday          0.2
Status           17.8
Salary            0.2
Taxes            99.3
Department        1.2
HourlyRate        0.2
MaritalStatus     2.5
OverTime          0.2
dtype: float64

In [9]:
#Eliminamos la(s) columna(s) que tengan más del 70% de valores nulos
for x in df:
    y= df[x].isna().mean()
    if y>0.7:
        df.drop(x, inplace=True,axis=1)

In [10]:
#Eliminamos la(s) fila(s) que tenga(n) menos de dos elementos
columnas = df.columns
for i in range(0, len(df)):
    y=df.loc[i,columnas].isna().sum()
    if y>2:
        df=df.drop([i])

In [11]:
#Reemplazamos los String “--" por valores nulos 
df.replace(to_replace="--", value=np.nan, inplace=True)

In [12]:
#Reemplazamos los valores nulos de la columna “Gender” por "U"
df['Gender'].fillna('U', inplace=True)

In [13]:
#Reemplazamos los valores nulos de la columna “Department” por “Bench”
df['Department'].fillna('Bench', inplace=True)

In [14]:
#Reemplazamos los valores nulos de la columna “HourlyRate” por la mediana
df.HourlyRate = pd.to_numeric(df.HourlyRate)
df.HourlyRate=df.HourlyRate.replace(np.nan,df.HourlyRate.median())

In [15]:
#Reemplazamos los valores perdidos inesperados de la columna “Overtime” por "No"
df.OverTime=df.OverTime.replace(["0","1"],np.nan)
df.OverTime=df.OverTime.replace(np.nan,"No")

In [16]:
#Guardamos el dataframe procesado en el destino elegido
df.to_csv('/content/drive/MyDrive/Caso_3/Caso_3_cleanData.csv',index=False)